_Rarzrabotki/Rarus/USO2/Documents/УСОERP_ДоговорССубподрядчиком.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Document>
		<Properties>
			<Name>УСОERP_ДоговорССубподрядчиком</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.УСОERP_ГрафикДвиженийПоДоговору</xr:Item>
				<xr:Item>AccumulationRegister.РасчетыСПоставщиками</xr:Item>
				<xr:Item>AccumulationRegister.РасчетыСПоставщикамиПоДокументам</xr:Item>
				<xr:Item>AccumulationRegister.УСОERP_ВыполнениеРаботСубподрядчиком</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Партнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектСтроительства</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СМ_ОбъектыСтроительства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДоговора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаДоговора</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Соглашение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СоглашенияСПоставщиками</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьПонижающийКоэффициент</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПонижающийКоэффициент</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыПланов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаправлениеДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументУтверждения</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.УСОERP_УтверждениеКалендарногоПланаГрафика</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УСОERP_РасширенныйГрафикДвижений</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УСОERP_ВведенПодчиненныйГрафик</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Работы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КодСДР</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Работа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УСОERP_СтроительныеРаботы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Объем</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаОбъема</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаНачала</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Длительность</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаДлительности</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ЕдиницыИзмеренияВремени</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаЗаказчика</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПонижающийКоэффициент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаСНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ГрафикДвиженияПоДоговору</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДатаСобытия</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДвиженияДенежныхСредств</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВариантыОплатыПоставщику</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДвиженияДоходРасход</Name>
							<Type>
								<v8:Type>cfg:EnumRef.УСОERP_ПорядокДоходовРасходов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбщаяСумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяБюджета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиБюджетов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидРабот</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УСОERP_ВидыРабот</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Работа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УСОERP_СтроительныеРаботы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаАванс</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаАванс</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПриемРабот</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПриемРабот</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОстатокПлатежа</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаОстатокПлатежа</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаУдержаниеОстатокПлатежа</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаИтогоОстатокПлатежа</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаВозвратГарантийногоУдержания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаВозвратГарантийногоУдержания</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДДС_Аванс</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВариантыОплатыПоставщику</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДДС_ПризнаниеДоходаРасхода</Name>
							<Type>
								<v8:Type>cfg:EnumRef.УСОERP_ПорядокДоходовРасходов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДДС_ОстатокПлатежа</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВариантыОплатыПоставщику</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДДС_ВозвратГарантийногоУдержания</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВариантыОплатыПоставщику</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сторно</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяБюджета_Аванс</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиБюджетов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяБюджета_ПризнаниеДоходаРасхода</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиБюджетов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяБюджета_ОстатокПлатежа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиБюджетов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяБюджета_ВозвратГарантийногоУдержания</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиБюджетов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Enums/УСОERP_ПорядокДоходовРасходов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>УСОERP_ПорядокДоходовРасходов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Реализация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоступлениеЗатрат</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Documents/УСОERP_ДоговорССубподрядчиком/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область Прочее

// Заполняет таблицу реквизитов, зависимых от хозяйственной операции
//
// Параметры:
//	ХозяйственнаяОперация - ПеречислениеСсылка.ХозяйственныеОперации - хозяйственная операция соглашения
//	МассивВсехРеквизитов - Массив - реквизиты, которые не зависят от хозяйственной операции
//	МассивРеквизитовОперации - Массив - реквизиты, которые зависят от хозяйственной операции
//
Процедура ЗаполнитьИменаРеквизитовПоОперации(ВидОперации, МассивВсехРеквизитов, МассивРеквизитовОперации) Экспорт
	
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Проведение

Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства, Регистры = Неопределено) Экспорт
	
	////////////////////////////////////////////////////////////////////////////
	// Создадим запрос инициализации движений
	
	Запрос = Новый Запрос;
	ЗаполнитьПараметрыИнициализации(Запрос, ДокументСсылка); 	
	
	////////////////////////////////////////////////////////////////////////////
	// Сформируем текст запроса 
	
	ТекстыЗапроса = Новый СписокЗначений;
	ТекстЗапросаВтТаблицаРаботы(Запрос, ТекстыЗапроса, Регистры);
	ТекстЗапросаТаблицаВыполнениеРаботСубподрядчиком(Запрос, ТекстыЗапроса, Регистры);
	ТекстЗапроса_ГрафикДвиженийПоДоговору(Запрос, ТекстыЗапроса, Регистры);
	ТекстЗапроса_РегистрНакопленияРасчеты(Запрос, ТекстыЗапроса, Регистры);
	ПроведениеСерверУТ.ИнициализироватьТаблицыДляДвижений(Запрос, ТекстыЗапроса, ДополнительныеСвойства.ТаблицыДляДвижений, Истина);	
	
КонецПроцедуры

Процедура ЗаполнитьПараметрыИнициализации(Запрос, ДокументСсылка)
	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	УСОERP_ДоговорССубподрядчиком.Дата КАК Период,
	|	УСОERP_ДоговорССубподрядчиком.Ссылка КАК Ссылка,
	|	УСОERP_ДоговорССубподрядчиком.ОбъектСтроительства КАК ОбъектСтроительства,
	|	УСОERP_ДоговорССубподрядчиком.Организация КАК Организация,
	|	УСОERP_ДоговорССубподрядчиком.Контрагент КАК Контрагент,
	|	УСОERP_ДоговорССубподрядчиком.Договор КАК Договор,
	|	УСОERP_ДоговорССубподрядчиком.Валюта КАК Валюта,
	|	УСОERP_ДоговорССубподрядчиком.Соглашение КАК Соглашение,
	|	УСОERP_ДоговорССубподрядчиком.Партнер КАК Партнер,
	|	УСОERP_ДоговорССубподрядчиком.УСОERP_РасширенныйГрафикДвижений КАК РасширенныйГрафикДвижений,
	|	УСОERP_ДоговорССубподрядчиком.Номер КАК Номер
	|ИЗ
	|	Документ.УСОERP_ДоговорССубподрядчиком КАК УСОERP_ДоговорССубподрядчиком
	|ГДЕ
	|	УСОERP_ДоговорССубподрядчиком.Ссылка = &Ссылка";
	
	Реквизиты = Запрос.Выполнить().Выбрать();
	
	Реквизиты.Следующий();
	
	Запрос.УстановитьПараметр("Соглашение",                                  Реквизиты.Соглашение);
	Запрос.УстановитьПараметр("Партнер",                                     Реквизиты.Партнер);
	Запрос.УстановитьПараметр("ОбъектСтроительства",                         Реквизиты.ОбъектСтроительства);
	Запрос.УстановитьПараметр("Период",                                      Реквизиты.Период);
	Запрос.УстановитьПараметр("Валюта",                                      Реквизиты.Валюта);
	Запрос.УстановитьПараметр("Организация",                                 Реквизиты.Организация);
	Запрос.УстановитьПараметр("Контрагент",                                  Реквизиты.Контрагент);
	Запрос.УстановитьПараметр("Договор",                               		 Реквизиты.Договор);
	Запрос.УстановитьПараметр("РасширенныйГрафикДвижений",                   Реквизиты.РасширенныйГрафикДвижений);
	Запрос.УстановитьПараметр("Номер",                                       Реквизиты.Номер);   	

	Запрос.УстановитьПараметр("Планирование_ЗаказПоставщику",	             Перечисления.ХозяйственныеОперации.ПланированиеПоЗаказуПоставщику);
	Запрос.УстановитьПараметр("Ссылка", 						             ДокументСсылка);
	
	АналитикаУчетаПоПартнерам = РегистрыСведений.АналитикаУчетаПоПартнерам.ЗначениеКлючаАналитики(ДокументСсылка);
	
	Если НЕ ЗначениеЗаполнено(АналитикаУчетаПоПартнерам) Тогда
		АналитикаУчетаПоПартнерам = РегистрыСведений.АналитикаУчетаПоПартнерам.СоздатьКлючАналитики(ДокументСсылка);
	КонецЕсли; 	

	Запрос.УстановитьПараметр("АналитикаУчетаПоПартнерам",		АналитикаУчетаПоПартнерам);
	
	ДокументДопПараметры = УСОERP_МодификацияКонфигурации.ПолучитьДополнительныеПараметрыПоДоговору(ДокументСсылка.Договор,ДокументСсылка.ОбъектСтроительства,ДокументСсылка.Дата,Истина,ДокументСсылка.ДокументУтверждения);
	Запрос.УстановитьПараметр("ДопПараметрыПоДоговору",УСОERP_МодификацияКонфигурации.ПолучитьДополнительныеПараметрыПоДоговору(ДокументСсылка.Договор,ДокументСсылка.ОбъектСтроительства,ДокументСсылка.Дата,Истина,ДокументСсылка.ДокументУтверждения));
	Запрос.УстановитьПараметр("ПоВидамРабот",          ДокументДопПараметры.ПоВидамРабот);
	Запрос.УстановитьПараметр("ПоРаботам",             ДокументДопПараметры.ПоРаботам); 	
	Запрос.УстановитьПараметр("ГраницаДаты",           Новый Граница(ДокументСсылка,ВидГраницы.Исключая)); 
	Запрос.УстановитьПараметр("ДелатьСторно",          ДокументСсылка.ГрафикДвиженияПоДоговору.Количество()>0);	
	
КонецПроцедуры

Функция ТекстЗапросаВтТаблицаРаботы(Запрос, ТекстыЗапроса, Регистры)
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	УСОERP_ДоговорССубподрядчикомРаботы.Работа,
	|	УСОERP_ДоговорССубподрядчикомРаботы.Объем,
	|	УСОERP_ДоговорССубподрядчикомРаботы.ЕдиницаОбъема,
	|	УСОERP_ДоговорССубподрядчикомРаботы.ДатаНачала,
	|	УСОERP_ДоговорССубподрядчикомРаботы.ДатаОкончания,
	|	УСОERP_ДоговорССубподрядчикомРаботы.Длительность,
	|	УСОERP_ДоговорССубподрядчикомРаботы.ЕдиницаДлительности,
	|	УСОERP_ДоговорССубподрядчикомРаботы.СуммаСНДС,
	|	УСОERP_ДоговорССубподрядчикомРаботы.СтавкаНДС,
	|	УСОERP_ДоговорССубподрядчикомРаботы.СуммаНДС,
	|	УСОERP_ДоговорССубподрядчикомРаботы.НомерСтроки
	|ПОМЕСТИТЬ ВтТаблицаРаботы
	|ИЗ
	|	Документ.УСОERP_ДоговорССубподрядчиком.Работы КАК УСОERP_ДоговорССубподрядчикомРаботы
	|ГДЕ
	|	УСОERP_ДоговорССубподрядчикомРаботы.Ссылка = &Ссылка
	|	И НЕ УСОERP_ДоговорССубподрядчикомРаботы.Работа.СуммарнаяРабота";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, "");
	
	Возврат ТекстЗапроса;	
	
КонецФункции

Функция ТекстЗапросаТаблицаВыполнениеРаботСубподрядчиком(Запрос, ТекстыЗапроса, Регистры)
	
	ИмяРегистра = "ВыполнениеРаботСубподрядчиком";
	
	Если НЕ ПроведениеСерверУТ.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли; 
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.Период,
	|	ВложенныйЗапрос.ВидДвижения,
	|	ВложенныйЗапрос.Организация,
	|	ВложенныйЗапрос.ОбъектСтроительства,
	|	ВложенныйЗапрос.Контрагент,
	|	ВложенныйЗапрос.Договор,
	|	ВложенныйЗапрос.Соглашение,
	|	ВложенныйЗапрос.Партнер,
	|	СУММА(ВложенныйЗапрос.НомерСтроки) КАК НомерСтроки,
	|	ВложенныйЗапрос.Работа,
	|	СУММА(ВложенныйЗапрос.Объем) КАК Объем,
	|	СУММА(ВложенныйЗапрос.СуммаСНДС) КАК СуммаСНДС,
	|	СУММА(ВложенныйЗапрос.СуммаНДС) КАК СуммаНДС,
	|	ВложенныйЗапрос.ЕдиницаОбъема,
	|	ВложенныйЗапрос.ДатаНачала,
	|	ВложенныйЗапрос.ДатаОкончания,
	|	ВложенныйЗапрос.Длительность,
	|	ВложенныйЗапрос.ЕдиницаДлительности
	|ИЗ
	|	(ВЫБРАТЬ
	|		&Период КАК Период,
	|		ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|		&Организация КАК Организация,
	|		&ОбъектСтроительства КАК ОбъектСтроительства,
	|		&Контрагент КАК Контрагент,
	|		&Договор КАК Договор,
	|		&Соглашение КАК Соглашение,
	|		&Партнер КАК Партнер,
	|		ТаблицаРаботы.НомерСтроки КАК НомерСтроки,
	|		ВЫБОР
	|			КОГДА ТаблицаРаботы.Работа.РаботаИсточник = ЗНАЧЕНИЕ(Справочник.УСОERP_СтроительныеРаботы.ПустаяСсылка)
	|				ТОГДА ТаблицаРаботы.Работа
	|			ИНАЧЕ ТаблицаРаботы.Работа.РаботаИсточник
	|		КОНЕЦ КАК Работа,
	|		ТаблицаРаботы.Объем КАК Объем,
	|		ТаблицаРаботы.СуммаСНДС КАК СуммаСНДС,
	|		ТаблицаРаботы.СуммаНДС КАК СуммаНДС,
	|		ТаблицаРаботы.ЕдиницаОбъема КАК ЕдиницаОбъема,
	|		ТаблицаРаботы.ДатаНачала КАК ДатаНачала,
	|		ТаблицаРаботы.ДатаОкончания КАК ДатаОкончания,
	|		ТаблицаРаботы.Длительность КАК Длительность,
	|		ТаблицаРаботы.ЕдиницаДлительности КАК ЕдиницаДлительности
	|	ИЗ
	|		ВтТаблицаРаботы КАК ТаблицаРаботы
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		&Период,
	|		ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	|		УСОERP_ВыполнениеРаботСубподрядчиком.Организация,
	|		УСОERP_ВыполнениеРаботСубподрядчиком.ОбъектСтроительства,
	|		УСОERP_ВыполнениеРаботСубподрядчиком.Контрагент,
	|		УСОERP_ВыполнениеРаботСубподрядчиком.Договор,
	|		УСОERP_ВыполнениеРаботСубподрядчиком.Соглашение,
	|		УСОERP_ВыполнениеРаботСубподрядчиком.Партнер,
	|		0,
	|		УСОERP_ВыполнениеРаботСубподрядчиком.Работа,
	|		-УСОERP_ВыполнениеРаботСубподрядчиком.Объем,
	|		-УСОERP_ВыполнениеРаботСубподрядчиком.СуммаСНДС,
	|		-УСОERP_ВыполнениеРаботСубподрядчиком.СуммаНДС,
	|		УСОERP_ВыполнениеРаботСубподрядчиком.ЕдиницаОбъема,
	|		УСОERP_ВыполнениеРаботСубподрядчиком.ДатаНачала,
	|		УСОERP_ВыполнениеРаботСубподрядчиком.ДатаОкончания,
	|		УСОERP_ВыполнениеРаботСубподрядчиком.Длительность,
	|		УСОERP_ВыполнениеРаботСубподрядчиком.ЕдиницаДлительности
	|	ИЗ
	|		РегистрНакопления.УСОERP_ВыполнениеРаботСубподрядчиком КАК УСОERP_ВыполнениеРаботСубподрядчиком
	|	ГДЕ
	|		УСОERP_ВыполнениеРаботСубподрядчиком.Период <= &Период
	|		И УСОERP_ВыполнениеРаботСубподрядчиком.Регистратор <> &Ссылка
	|		И УСОERP_ВыполнениеРаботСубподрядчиком.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|		И УСОERP_ВыполнениеРаботСубподрядчиком.Контрагент = &Контрагент
	|		И УСОERP_ВыполнениеРаботСубподрядчиком.Договор = &Договор 
	|		И УСОERP_ВыполнениеРаботСубподрядчиком.ОбъектСтроительства = &ОбъектСтроительства
	|		И УСОERP_ВыполнениеРаботСубподрядчиком.Организация = &Организация) КАК ВложенныйЗапрос
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.Период,
	|	ВложенныйЗапрос.ВидДвижения,
	|	ВложенныйЗапрос.Организация,
	|	ВложенныйЗапрос.ОбъектСтроительства,
	|	ВложенныйЗапрос.Контрагент,
	|	ВложенныйЗапрос.Договор,
	|	ВложенныйЗапрос.Соглашение,
	|	ВложенныйЗапрос.Партнер,
	|	ВложенныйЗапрос.Работа,
	|	ВложенныйЗапрос.ЕдиницаОбъема,
	|	ВложенныйЗапрос.ДатаНачала,
	|	ВложенныйЗапрос.ДатаОкончания,
	|	ВложенныйЗапрос.Длительность,
	|	ВложенныйЗапрос.ЕдиницаДлительности
	|
	|ИМЕЮЩИЕ
	|	(СУММА(ВложенныйЗапрос.Объем) <> 0
	|		ИЛИ СУММА(ВложенныйЗапрос.СуммаСНДС) <> 0
	|		ИЛИ СУММА(ВложенныйЗапрос.СуммаНДС) <> 0)
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапроса_ГрафикДвиженийПоДоговору(Запрос, ТекстыЗапроса, Регистры)
	
	ИмяРегистра = "ГрафикДвиженийПоДоговору";
	
	Если НЕ ПроведениеСерверУТ.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли;  	
	
	Если Запрос.Параметры.РасширенныйГрафикДвижений Тогда  		
		
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
		|	УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.ДатаАванс КАК Период,
		|	УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.Ссылка КАК Регистратор,
		|	УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.Ссылка.Организация КАК Организация,
		|	УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.Ссылка.Партнер КАК Партнер,
		|	УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.Ссылка.Контрагент КАК Контрагент,
		|	ДоговорыКонтрагентов.Ссылка КАК Договор,
		|	УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.ДатаАванс КАК ДатаСобытияПоДоговору,
		|	УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.ВидДДС_Аванс КАК ПорядокОплаты,
		|	ЗНАЧЕНИЕ(Перечисление.УСОERP_ПорядокДоходовРасходов.ПустаяСсылка) КАК ПорядокДоходовРасходов,
		|	ВЫБОР
		|		КОГДА &ПоВидамРабот
		|			ТОГДА УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.ВидРабот
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.УСОERP_ВидыРабот.ПустаяСсылка)
		|	КОНЕЦ КАК ВидРабот,
		|	ВЫБОР
		|		КОГДА &ПоРаботам
		|			ТОГДА ВЫБОР
		|					КОГДА УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.Работа.РаботаИсточник = ЗНАЧЕНИЕ(Справочник.УСОERP_СтроительныеРаботы.ПустаяСсылка)
		|						ТОГДА УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.Работа
		|					ИНАЧЕ УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.Работа.РаботаИсточник
		|				КОНЕЦ
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.УСОERP_СтроительныеРаботы.ПустаяСсылка)
		|	КОНЕЦ КАК Работа,
		|	УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.Ссылка.ОбъектСтроительства КАК ОбъектСтроительства,
		|	УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.СуммаАванс КАК ФинансированиеПлан,
		|	0 КАК ФинансированиеФакт,
		|	0 КАК ПорядокДоходовРасходовПлан,
		|	0 КАК ПорядокДоходовРасходовФакт,
		|	ДоговорыКонтрагентов.Ссылка.СтатьяДвиженияДенежныхСредств КАК СсылкаСтатьяДвиженияДенежныхСредств,
		|	УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.СтатьяБюджета_Аванс КАК СтатьяБюджета,
		|	УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.Ссылка.Дата КАК Дата,
		|	УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.Ссылка.Соглашение КАК Соглашение
		|ИЗ
		|	Документ.УСОERP_ДоговорССубподрядчиком.ГрафикДвиженияПоДоговору КАК УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|		ПО УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.Ссылка.Договор = ДоговорыКонтрагентов.Ссылка
		|ГДЕ
		|	УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.Ссылка = &Ссылка
		|	И УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.ДатаАванс <> ДАТАВРЕМЯ(1, 1, 1)
		|	И НЕ УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.Ссылка.ПометкаУдаления
		|	И УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.СуммаАванс > 0
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
		|	УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.ДатаОстатокПлатежа,
		|	УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.Ссылка,
		|	УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.Ссылка.Организация,
		|	УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.Ссылка.Партнер,
		|	УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.Ссылка.Контрагент,
		|	ДоговорыКонтрагентов.Ссылка,
		|	УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.ДатаОстатокПлатежа,
		|	УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.ВидДДС_ОстатокПлатежа,
		|	ЗНАЧЕНИЕ(Перечисление.УСОERP_ПорядокДоходовРасходов.ПустаяСсылка),
		|	ВЫБОР
		|		КОГДА &ПоВидамРабот
		|			ТОГДА УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.ВидРабот
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.УСОERP_ВидыРабот.ПустаяСсылка)
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &ПоРаботам
		|			ТОГДА ВЫБОР
		|					КОГДА УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.Работа.РаботаИсточник = ЗНАЧЕНИЕ(Справочник.УСОERP_СтроительныеРаботы.ПустаяСсылка)
		|						ТОГДА УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.Работа
		|					ИНАЧЕ УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.Работа.РаботаИсточник
		|				КОНЕЦ
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.УСОERP_СтроительныеРаботы.ПустаяСсылка)
		|	КОНЕЦ,
		|	УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.Ссылка.ОбъектСтроительства,
		|	УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.СуммаОстатокПлатежа,
		|	0,
		|	0,
		|	0,
		|	ДоговорыКонтрагентов.Ссылка.СтатьяДвиженияДенежныхСредств,
		|	УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.СтатьяБюджета_ОстатокПлатежа,
		|	УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.Ссылка.Дата,
		|	УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.Ссылка.Соглашение
		|ИЗ
		|	Документ.УСОERP_ДоговорССубподрядчиком.ГрафикДвиженияПоДоговору КАК УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|		ПО УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.Ссылка.Договор = ДоговорыКонтрагентов.Ссылка
		|ГДЕ
		|	УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.Ссылка = &Ссылка
		|	И УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.ДатаОстатокПлатежа <> ДАТАВРЕМЯ(1, 1, 1)
		|	И НЕ УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.Ссылка.ПометкаУдаления
		|	И УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.СуммаОстатокПлатежа > 0
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
		|	УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.ДатаВозвратГарантийногоУдержания,
		|	УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.Ссылка,
		|	УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.Ссылка.Организация,
		|	УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.Ссылка.Партнер,
		|	УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.Ссылка.Контрагент,
		|	ДоговорыКонтрагентов.Ссылка,
		|	УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.ДатаВозвратГарантийногоУдержания,
		|	УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.ВидДДС_ВозвратГарантийногоУдержания,
		|	ЗНАЧЕНИЕ(Перечисление.УСОERP_ПорядокДоходовРасходов.ПустаяСсылка),
		|	ВЫБОР
		|		КОГДА &ПоВидамРабот
		|			ТОГДА УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.ВидРабот
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.УСОERP_ВидыРабот.ПустаяСсылка)
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &ПоРаботам
		|			ТОГДА ВЫБОР
		|					КОГДА УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.Работа.РаботаИсточник = ЗНАЧЕНИЕ(Справочник.УСОERP_СтроительныеРаботы.ПустаяСсылка)
		|						ТОГДА УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.Работа
		|					ИНАЧЕ УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.Работа.РаботаИсточник
		|				КОНЕЦ
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.УСОERP_СтроительныеРаботы.ПустаяСсылка)
		|	КОНЕЦ,
		|	УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.Ссылка.ОбъектСтроительства,
		|	УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.СуммаВозвратГарантийногоУдержания,
		|	0,
		|	0,
		|	0,
		|	ДоговорыКонтрагентов.Ссылка.СтатьяДвиженияДенежныхСредств,
		|	УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.СтатьяБюджета_ВозвратГарантийногоУдержания,
		|	УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.Ссылка.Дата,
		|	УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.Ссылка.Соглашение
		|ИЗ
		|	Документ.УСОERP_ДоговорССубподрядчиком.ГрафикДвиженияПоДоговору КАК УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|		ПО УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.Ссылка.Договор = ДоговорыКонтрагентов.Ссылка
		|ГДЕ
		|	УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.Ссылка = &Ссылка
		|	И УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.ДатаВозвратГарантийногоУдержания <> ДАТАВРЕМЯ(1, 1, 1)
		|	И НЕ УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.Ссылка.ПометкаУдаления
		|	И УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.СуммаВозвратГарантийногоУдержания > 0
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
		|	УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.ДатаПриемРабот,
		|	УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.Ссылка,
		|	УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.Ссылка.Организация,
		|	УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.Ссылка.Партнер,
		|	УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.Ссылка.Контрагент,
		|	ДоговорыКонтрагентов.Ссылка,
		|	УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.ДатаПриемРабот,
		|	ЗНАЧЕНИЕ(Перечисление.ВариантыОплатыПоставщику.ПустаяСсылка),
		|	ВЫБОР
		|		КОГДА ДоговорыКонтрагентов.ТипДоговора = ЗНАЧЕНИЕ(Перечисление.ТипыДоговоров.СПоставщиком)
		|				ИЛИ ДоговорыКонтрагентов.ТипДоговора = ЗНАЧЕНИЕ(Перечисление.ТипыДоговоров.СПереработчиком)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.УСОERP_ПорядокДоходовРасходов.ПоступлениеЗатрат)
		|		КОГДА ДоговорыКонтрагентов.ТипДоговора = ЗНАЧЕНИЕ(Перечисление.ТипыДоговоров.СПокупателем)
		|				ИЛИ ДоговорыКонтрагентов.ТипДоговора = ЗНАЧЕНИЕ(Перечисление.ТипыДоговоров.СДавальцем)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.УСОERP_ПорядокДоходовРасходов.Реализация)
		|		ИНАЧЕ NULL
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &ПоВидамРабот
		|			ТОГДА УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.ВидРабот
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.УСОERP_ВидыРабот.ПустаяСсылка)
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &ПоРаботам
		|			ТОГДА ВЫБОР
		|					КОГДА УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.Работа.РаботаИсточник = ЗНАЧЕНИЕ(Справочник.УСОERP_СтроительныеРаботы.ПустаяСсылка)
		|						ТОГДА УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.Работа
		|					ИНАЧЕ УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.Работа.РаботаИсточник
		|				КОНЕЦ
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.УСОERP_СтроительныеРаботы.ПустаяСсылка)
		|	КОНЕЦ,
		|	УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.Ссылка.ОбъектСтроительства,
		|	0,
		|	0,
		|	УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.СуммаПриемРабот,
		|	0,
		|	ДоговорыКонтрагентов.Ссылка.СтатьяДвиженияДенежныхСредств,
		|	УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.СтатьяБюджета_ПризнаниеДоходаРасхода,
		|	УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.Ссылка.Дата,
		|	УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.Ссылка.Соглашение
		|ИЗ
		|	Документ.УСОERP_ДоговорССубподрядчиком.ГрафикДвиженияПоДоговору КАК УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|		ПО УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.Ссылка.Договор = ДоговорыКонтрагентов.Ссылка
		|ГДЕ
		|	УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.Ссылка = &Ссылка
		|	И УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.ДатаПриемРабот <> ДАТАВРЕМЯ(1, 1, 1)
		|	И НЕ УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.Ссылка.ПометкаУдаления
		|	И УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.СуммаПриемРабот > 0
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВложенныйЗапрос.ВидДвижения,
		|	&Период,
		|	&Ссылка,
		|	ВложенныйЗапрос.Организация,
		|	ВложенныйЗапрос.Партнер,
		|	ВложенныйЗапрос.Контрагент,
		|	ВложенныйЗапрос.Договор,
		|	ВложенныйЗапрос.ДатаСобытияПоДоговору,
		|	ВложенныйЗапрос.ПорядокОплаты,
		|	ВложенныйЗапрос.ПорядокДоходовРасходов,
		|	ВложенныйЗапрос.ВидРабот,
		|	ВложенныйЗапрос.Работа,
		|	ВложенныйЗапрос.ОбъектСтроительства,
		|	-ВложенныйЗапрос.ФинансированиеПлан,
		|	-ВложенныйЗапрос.ФинансированиеФакт,
		|	-ВложенныйЗапрос.ПорядокДоходовРасходовПлан,
		|	-ВложенныйЗапрос.ПорядокДоходовРасходовФакт,
		|	NULL,
		|	ВложенныйЗапрос.СтатьяБюджета,
		|	ВложенныйЗапрос.ДатаСобытияПоДоговору,
		|	ВложенныйЗапрос.Соглашение
		|ИЗ
		|	(ВЫБРАТЬ
		|		УСОERP_ГрафикДвиженийПоДоговору.ВидДвижения КАК ВидДвижения,
		|		УСОERP_ГрафикДвиженийПоДоговору.Организация КАК Организация,
		|		УСОERP_ГрафикДвиженийПоДоговору.Партнер КАК Партнер,
		|		УСОERP_ГрафикДвиженийПоДоговору.Соглашение КАК Соглашение,
		|		УСОERP_ГрафикДвиженийПоДоговору.Контрагент КАК Контрагент,
		|		УСОERP_ГрафикДвиженийПоДоговору.Договор КАК Договор,
		|		УСОERP_ГрафикДвиженийПоДоговору.ДатаСобытияПоДоговору КАК ДатаСобытияПоДоговору,
		|		УСОERP_ГрафикДвиженийПоДоговору.ПорядокОплаты КАК ПорядокОплаты,
		|		УСОERP_ГрафикДвиженийПоДоговору.ПорядокДоходовРасходов КАК ПорядокДоходовРасходов,
		|		УСОERP_ГрафикДвиженийПоДоговору.ВидРабот КАК ВидРабот,
		|		УСОERP_ГрафикДвиженийПоДоговору.Работа КАК Работа,
		|		УСОERP_ГрафикДвиженийПоДоговору.ОбъектСтроительства КАК ОбъектСтроительства,
		|		УСОERP_ГрафикДвиженийПоДоговору.СтатьяБюджета КАК СтатьяБюджета,
		|		СУММА(УСОERP_ГрафикДвиженийПоДоговору.ФинансированиеФакт) КАК ФинансированиеФакт,
		|		СУММА(УСОERP_ГрафикДвиженийПоДоговору.ФинансированиеПлан) КАК ФинансированиеПлан,
		|		СУММА(УСОERP_ГрафикДвиженийПоДоговору.ПорядокДоходовРасходовПлан) КАК ПорядокДоходовРасходовПлан,
		|		СУММА(УСОERP_ГрафикДвиженийПоДоговору.ПорядокДоходовРасходовФакт) КАК ПорядокДоходовРасходовФакт
		|	ИЗ
		|		РегистрНакопления.УСОERP_ГрафикДвиженийПоДоговору КАК УСОERP_ГрафикДвиженийПоДоговору
		|	ГДЕ
		|		УСОERP_ГрафикДвиженийПоДоговору.Договор = &Договор
		|		И УСОERP_ГрафикДвиженийПоДоговору.ОбъектСтроительства = &ОбъектСтроительства
		|		И УСОERP_ГрафикДвиженийПоДоговору.Регистратор.Дата <= &Период
		|		И УСОERP_ГрафикДвиженийПоДоговору.Регистратор <> &Ссылка
		|		И (УСОERP_ГрафикДвиженийПоДоговору.Регистратор ССЫЛКА Документ.УСОERP_ДоговорССубподрядчиком
		|				ИЛИ УСОERP_ГрафикДвиженийПоДоговору.Регистратор ССЫЛКА Документ.УСОERP_ГрафикДвиженийПоДоговору)
		|		И УСОERP_ГрафикДвиженийПоДоговору.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|	
		|	СГРУППИРОВАТЬ ПО
		|		УСОERP_ГрафикДвиженийПоДоговору.Организация,
		|		УСОERP_ГрафикДвиженийПоДоговору.Партнер,
		|		УСОERP_ГрафикДвиженийПоДоговору.ВидДвижения,
		|		УСОERP_ГрафикДвиженийПоДоговору.ПорядокДоходовРасходов,
		|		УСОERP_ГрафикДвиженийПоДоговору.ПорядокОплаты,
		|		УСОERP_ГрафикДвиженийПоДоговору.Соглашение,
		|		УСОERP_ГрафикДвиженийПоДоговору.СтатьяБюджета,
		|		УСОERP_ГрафикДвиженийПоДоговору.ДатаСобытияПоДоговору,
		|		УСОERP_ГрафикДвиженийПоДоговору.Договор,
		|		УСОERP_ГрафикДвиженийПоДоговору.ВидРабот,
		|		УСОERP_ГрафикДвиженийПоДоговору.Работа,
		|		УСОERP_ГрафикДвиженийПоДоговору.ОбъектСтроительства,
		|		УСОERP_ГрафикДвиженийПоДоговору.Контрагент) КАК ВложенныйЗапрос
		|ГДЕ
		|	(-ВложенныйЗапрос.ФинансированиеПлан <> 0
		|			ИЛИ -ВложенныйЗапрос.ФинансированиеФакт <> 0
		|			ИЛИ -ВложенныйЗапрос.ПорядокДоходовРасходовПлан <> 0
		|			ИЛИ -ВложенныйЗапрос.ПорядокДоходовРасходовФакт <> 0)
		|	И &ДелатьСторно = ИСТИНА
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДатаСобытияПоДоговору";			
		
	Иначе  		
		
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
		|	УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.ДатаСобытия КАК Период,
		|	УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.Ссылка КАК Регистратор,
		|	УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.Ссылка.Организация КАК Организация,
		|	УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.Ссылка.Партнер КАК Партнер,
		|	УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.Ссылка.Контрагент КАК Контрагент,
		|	ДоговорыКонтрагентов.Ссылка КАК Договор,
		|	УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.ДатаСобытия КАК ДатаСобытияПоДоговору,
		|	УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.ВидДвиженияДенежныхСредств КАК ПорядокОплаты,
		|	УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.ВидДвиженияДоходРасход КАК ПорядокДоходовРасходов,
		|	ВЫБОР
		|		КОГДА &ПоВидамРабот
		|			ТОГДА УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.ВидРабот
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.УСОERP_ВидыРабот.ПустаяСсылка)
		|	КОНЕЦ КАК ВидРабот,
		|	ВЫБОР
		|		КОГДА &ПоРаботам
		|			ТОГДА ВЫБОР
		|					КОГДА УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.Работа.РаботаИсточник = ЗНАЧЕНИЕ(Справочник.УСОERP_СтроительныеРаботы.ПустаяСсылка)
		|						ТОГДА УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.Работа
		|					ИНАЧЕ УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.Работа.РаботаИсточник
		|				КОНЕЦ
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.УСОERP_СтроительныеРаботы.ПустаяСсылка)
		|	КОНЕЦ КАК Работа,
		|	УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.Ссылка.ОбъектСтроительства КАК ОбъектСтроительства,
		|	УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.ОбщаяСумма КАК ФинансированиеПлан,
		|	0 КАК ФинансированиеФакт,
		|	0 КАК ПорядокДоходовРасходовПлан,
		|	0 КАК ПорядокДоходовРасходовФакт,
		|	ДоговорыКонтрагентов.Ссылка.СтатьяДвиженияДенежныхСредств КАК СсылкаСтатьяДвиженияДенежныхСредств,
		|	УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.СтатьяБюджета КАК СтатьяБюджета,
		|	УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.Ссылка.Дата КАК Дата,
		|	УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.Ссылка.Соглашение КАК Соглашение
		|ИЗ
		|	Документ.УСОERP_ДоговорССубподрядчиком.ГрафикДвиженияПоДоговору КАК УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|		ПО УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.Ссылка.Договор = ДоговорыКонтрагентов.Ссылка
		|ГДЕ
		|	УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.Ссылка = &Ссылка
		|	И УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.ВидДвиженияДенежныхСредств ССЫЛКА Перечисление.ВариантыОплатыПоставщику
		|	И УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.ВидДвиженияДенежныхСредств <> ЗНАЧЕНИЕ(Перечисление.ВариантыОплатыПоставщику.ПустаяСсылка)
		|	И НЕ УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.Ссылка.ПометкаУдаления
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
		|	УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.ДатаСобытия,
		|	УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.Ссылка,
		|	УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.Ссылка.Организация,
		|	УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.Ссылка.Партнер,
		|	УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.Ссылка.Контрагент,
		|	ДоговорыКонтрагентов.Ссылка,
		|	УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.ДатаСобытия,
		|	УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.ВидДвиженияДенежныхСредств,
		|	УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.ВидДвиженияДоходРасход,
		|	ВЫБОР
		|		КОГДА &ПоВидамРабот
		|			ТОГДА УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.ВидРабот
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.УСОERP_ВидыРабот.ПустаяСсылка)
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &ПоРаботам
		|			ТОГДА ВЫБОР
		|					КОГДА УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.Работа.РаботаИсточник = ЗНАЧЕНИЕ(Справочник.УСОERP_СтроительныеРаботы.ПустаяСсылка)
		|						ТОГДА УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.Работа
		|					ИНАЧЕ УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.Работа.РаботаИсточник
		|				КОНЕЦ
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.УСОERP_СтроительныеРаботы.ПустаяСсылка)
		|	КОНЕЦ,
		|	УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.Ссылка.ОбъектСтроительства,
		|	0,
		|	0,
		|	УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.ОбщаяСумма,
		|	0,
		|	ДоговорыКонтрагентов.Ссылка.СтатьяДвиженияДенежныхСредств,
		|	УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.СтатьяБюджета,
		|	УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.Ссылка.Дата,
		|	УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.Ссылка.Соглашение
		|ИЗ
		|	Документ.УСОERP_ДоговорССубподрядчиком.ГрафикДвиженияПоДоговору КАК УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|		ПО УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.Ссылка.Договор = ДоговорыКонтрагентов.Ссылка
		|ГДЕ
		|	УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.Ссылка = &Ссылка
		|	И УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.ВидДвиженияДоходРасход ССЫЛКА Перечисление.УСОERP_ПорядокДоходовРасходов
		|	И УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.ВидДвиженияДоходРасход <> ЗНАЧЕНИЕ(Перечисление.УСОERP_ПорядокДоходовРасходов.ПустаяСсылка)
		|	И НЕ УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.Ссылка.ПометкаУдаления
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВложенныйЗапрос.ВидДвижения,
		|	&Период,
		|	&Ссылка,
		|	ВложенныйЗапрос.Организация,
		|	ВложенныйЗапрос.Партнер,
		|	ВложенныйЗапрос.Контрагент,
		|	ВложенныйЗапрос.Договор,
		|	ВложенныйЗапрос.ДатаСобытияПоДоговору,
		|	ВложенныйЗапрос.ПорядокОплаты,
		|	ВложенныйЗапрос.ПорядокДоходовРасходов,
		|	ВложенныйЗапрос.ВидРабот,
		|	ВложенныйЗапрос.Работа,
		|	ВложенныйЗапрос.ОбъектСтроительства,
		|	-ВложенныйЗапрос.ФинансированиеПлан,
		|	-ВложенныйЗапрос.ФинансированиеФакт,
		|	-ВложенныйЗапрос.ПорядокДоходовРасходовПлан,
		|	-ВложенныйЗапрос.ПорядокДоходовРасходовФакт,
		|	NULL,
		|	ВложенныйЗапрос.СтатьяБюджета,
		|	ВложенныйЗапрос.ДатаСобытияПоДоговору,
		|	ВложенныйЗапрос.Соглашение
		|ИЗ
		|	(ВЫБРАТЬ
		|		УСОERP_ГрафикДвиженийПоДоговору.ВидДвижения КАК ВидДвижения,
		|		УСОERP_ГрафикДвиженийПоДоговору.Организация КАК Организация,
		|		УСОERP_ГрафикДвиженийПоДоговору.Партнер КАК Партнер,
		|		УСОERP_ГрафикДвиженийПоДоговору.Соглашение КАК Соглашение,
		|		УСОERP_ГрафикДвиженийПоДоговору.Контрагент КАК Контрагент,
		|		УСОERP_ГрафикДвиженийПоДоговору.Договор КАК Договор,
		|		УСОERP_ГрафикДвиженийПоДоговору.ДатаСобытияПоДоговору КАК ДатаСобытияПоДоговору,
		|		УСОERP_ГрафикДвиженийПоДоговору.ПорядокОплаты КАК ПорядокОплаты,
		|		УСОERP_ГрафикДвиженийПоДоговору.ПорядокДоходовРасходов КАК ПорядокДоходовРасходов,
		|		УСОERP_ГрафикДвиженийПоДоговору.ВидРабот КАК ВидРабот,
		|		УСОERP_ГрафикДвиженийПоДоговору.Работа КАК Работа,
		|		УСОERP_ГрафикДвиженийПоДоговору.ОбъектСтроительства КАК ОбъектСтроительства,
		|		УСОERP_ГрафикДвиженийПоДоговору.СтатьяБюджета КАК СтатьяБюджета,
		|		СУММА(УСОERP_ГрафикДвиженийПоДоговору.ФинансированиеФакт) КАК ФинансированиеФакт,
		|		СУММА(УСОERP_ГрафикДвиженийПоДоговору.ФинансированиеПлан) КАК ФинансированиеПлан,
		|		СУММА(УСОERP_ГрафикДвиженийПоДоговору.ПорядокДоходовРасходовПлан) КАК ПорядокДоходовРасходовПлан,
		|		СУММА(УСОERP_ГрафикДвиженийПоДоговору.ПорядокДоходовРасходовФакт) КАК ПорядокДоходовРасходовФакт
		|	ИЗ
		|		РегистрНакопления.УСОERP_ГрафикДвиженийПоДоговору КАК УСОERP_ГрафикДвиженийПоДоговору
		|	ГДЕ
		|		УСОERP_ГрафикДвиженийПоДоговору.Договор = &Договор
		|		И УСОERP_ГрафикДвиженийПоДоговору.ОбъектСтроительства = &ОбъектСтроительства
		|		И УСОERP_ГрафикДвиженийПоДоговору.Регистратор.Дата <= &Период
		|		И УСОERP_ГрафикДвиженийПоДоговору.Регистратор <> &Ссылка
		|		И (УСОERP_ГрафикДвиженийПоДоговору.Регистратор ССЫЛКА Документ.УСОERP_ДоговорССубподрядчиком
		|				ИЛИ УСОERP_ГрафикДвиженийПоДоговору.Регистратор ССЫЛКА Документ.УСОERP_ГрафикДвиженийПоДоговору)
		|		И УСОERP_ГрафикДвиженийПоДоговору.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|	
		|	СГРУППИРОВАТЬ ПО
		|		УСОERP_ГрафикДвиженийПоДоговору.Организация,
		|		УСОERP_ГрафикДвиженийПоДоговору.Партнер,
		|		УСОERP_ГрафикДвиженийПоДоговору.ВидДвижения,
		|		УСОERP_ГрафикДвиженийПоДоговору.ПорядокДоходовРасходов,
		|		УСОERP_ГрафикДвиженийПоДоговору.ПорядокОплаты,
		|		УСОERP_ГрафикДвиженийПоДоговору.Соглашение,
		|		УСОERP_ГрафикДвиженийПоДоговору.СтатьяБюджета,
		|		УСОERP_ГрафикДвиженийПоДоговору.ДатаСобытияПоДоговору,
		|		УСОERP_ГрафикДвиженийПоДоговору.Договор,
		|		УСОERP_ГрафикДвиженийПоДоговору.ВидРабот,
		|		УСОERP_ГрафикДвиженийПоДоговору.Работа,
		|		УСОERP_ГрафикДвиженийПоДоговору.ОбъектСтроительства,
		|		УСОERP_ГрафикДвиженийПоДоговору.Контрагент) КАК ВложенныйЗапрос
		|ГДЕ
		|	(-ВложенныйЗапрос.ФинансированиеПлан <> 0
		|			ИЛИ -ВложенныйЗапрос.ФинансированиеФакт <> 0
		|			ИЛИ -ВложенныйЗапрос.ПорядокДоходовРасходовПлан <> 0
		|			ИЛИ -ВложенныйЗапрос.ПорядокДоходовРасходовФакт <> 0)
		|	И &ДелатьСторно = ИСТИНА
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДатаСобытияПоДоговору";			
		
	КонецЕсли;
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапроса_РегистрНакопленияРасчеты(Запрос, ТекстыЗапроса, Регистры)
	
	ИмяРегистра = "РасчетыСПоставщиками";
	
	Если НЕ ПроведениеСерверУТ.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли; 
	
	Если Запрос.Параметры.РасширенныйГрафикДвижений Тогда
		
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
		|	ТЧ_ГрафикДвиженийПоДоговору.ДатаАванс КАК Период,
		|	&АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
		|	ТЧ_ГрафикДвиженийПоДоговору.Ссылка.Договор КАК ЗаказПоставщику,
		|	ДоговорыКонтрагентов.Ссылка.ВалютаВзаиморасчетов КАК Валюта,
		|	ТЧ_ГрафикДвиженийПоДоговору.СуммаАванс КАК КОплате,
		|	0 КАК КПоступлению,
		|	&Планирование_ЗаказПоставщику КАК ХозяйственнаяОперация,
		|	ТЧ_ГрафикДвиженийПоДоговору.Ссылка.Дата КАК ДатаРегистратора,
		|	&Номер КАК НомерРегистратора,
		|	ДоговорыКонтрагентов.Ссылка.ВалютаВзаиморасчетов КАК ВалютаДокумента,
		|	ТЧ_ГрафикДвиженийПоДоговору.ДатаАванс КАК ДатаПлатежа
		|   ,ЗНАЧЕНИЕ(Перечисление.ВариантыОплатыПоставщику.АвансДоПодтверждения) КАК ВариантОплаты
		|ИЗ
		|	Документ.УСОERP_ДоговорССубподрядчиком.ГрафикДвиженияПоДоговору КАК ТЧ_ГрафикДвиженийПоДоговору
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|		ПО ТЧ_ГрафикДвиженийПоДоговору.Ссылка.Договор = ДоговорыКонтрагентов.Ссылка
		|ГДЕ
		|	ТЧ_ГрафикДвиженийПоДоговору.Ссылка = &Ссылка
		|	И ТЧ_ГрафикДвиженийПоДоговору.ДатаАванс <> ДАТАВРЕМЯ(1, 1, 1)
		|	И ТЧ_ГрафикДвиженийПоДоговору.СуммаАванс > 0
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		//|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход),
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
		|	ТЧ_ГрафикДвиженийПоДоговору.ДатаПриемРабот,
		|	&АналитикаУчетаПоПартнерам,
		|	ТЧ_ГрафикДвиженийПоДоговору.Ссылка.Договор,
		|	ДоговорыКонтрагентов.Ссылка.ВалютаВзаиморасчетов,
		|	0,
		|	ТЧ_ГрафикДвиженийПоДоговору.СуммаПриемРабот,
		|	&Планирование_ЗаказПоставщику,
		|	ТЧ_ГрафикДвиженийПоДоговору.Ссылка.Дата,
		|	&Номер КАК НомерРегистратора,
		|	ДоговорыКонтрагентов.Ссылка.ВалютаВзаиморасчетов,
		|	ТЧ_ГрафикДвиженийПоДоговору.ДатаПриемРабот
		|   ,ЗНАЧЕНИЕ(Перечисление.ВариантыОплатыПоставщику.ПредоплатаДоПоступления)
		|ИЗ
		|	Документ.УСОERP_ДоговорССубподрядчиком.ГрафикДвиженияПоДоговору КАК ТЧ_ГрафикДвиженийПоДоговору
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|		ПО ТЧ_ГрафикДвиженийПоДоговору.Ссылка.Договор = ДоговорыКонтрагентов.Ссылка
		|ГДЕ
		|	ТЧ_ГрафикДвиженийПоДоговору.Ссылка = &Ссылка
		|	И ТЧ_ГрафикДвиженийПоДоговору.ДатаПриемРабот <> ДАТАВРЕМЯ(1, 1, 1)
		|	И ТЧ_ГрафикДвиженийПоДоговору.СуммаПриемРабот > 0
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход),
		|	ТЧ_ГрафикДвиженийПоДоговору.ДатаОстатокПлатежа,
		|	&АналитикаУчетаПоПартнерам,
		|	ТЧ_ГрафикДвиженийПоДоговору.Ссылка.Договор,
		|	ДоговорыКонтрагентов.Ссылка.ВалютаВзаиморасчетов,
		|	ТЧ_ГрафикДвиженийПоДоговору.СуммаОстатокПлатежа,
		|	0,
		|	&Планирование_ЗаказПоставщику,
		|	ТЧ_ГрафикДвиженийПоДоговору.Ссылка.Дата,
		|	&Номер КАК НомерРегистратора,
		|	ДоговорыКонтрагентов.Ссылка.ВалютаВзаиморасчетов,
		|	ТЧ_ГрафикДвиженийПоДоговору.ДатаОстатокПлатежа
		|   ,ЗНАЧЕНИЕ(Перечисление.ВариантыОплатыПоставщику.КредитПослеПоступления)
		|ИЗ
		|	Документ.УСОERP_ДоговорССубподрядчиком.ГрафикДвиженияПоДоговору КАК ТЧ_ГрафикДвиженийПоДоговору
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|		ПО ТЧ_ГрафикДвиженийПоДоговору.Ссылка.Договор = ДоговорыКонтрагентов.Ссылка
		|ГДЕ
		|	ТЧ_ГрафикДвиженийПоДоговору.Ссылка = &Ссылка
		|	И ТЧ_ГрафикДвиженийПоДоговору.ДатаОстатокПлатежа <> ДАТАВРЕМЯ(1, 1, 1)
		|	И ТЧ_ГрафикДвиженийПоДоговору.СуммаОстатокПлатежа > 0
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход),
		|	ТЧ_ГрафикДвиженийПоДоговору.ДатаВозвратГарантийногоУдержания,
		|	&АналитикаУчетаПоПартнерам,
		|	ТЧ_ГрафикДвиженийПоДоговору.Ссылка.Договор,
		|	ДоговорыКонтрагентов.Ссылка.ВалютаВзаиморасчетов,
		|	ТЧ_ГрафикДвиженийПоДоговору.СуммаВозвратГарантийногоУдержания,
		|	0,
		|	&Планирование_ЗаказПоставщику,
		|	ТЧ_ГрафикДвиженийПоДоговору.Ссылка.Дата,
		|	&Номер КАК НомерРегистратора,
		|	ДоговорыКонтрагентов.Ссылка.ВалютаВзаиморасчетов,
		|	ТЧ_ГрафикДвиженийПоДоговору.ДатаВозвратГарантийногоУдержания
		|   ,ЗНАЧЕНИЕ(Перечисление.ВариантыОплатыПоставщику.УСОERP_ГарантийноеУдержание)
		|ИЗ
		|	Документ.УСОERP_ДоговорССубподрядчиком.ГрафикДвиженияПоДоговору КАК ТЧ_ГрафикДвиженийПоДоговору
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|		ПО ТЧ_ГрафикДвиженийПоДоговору.Ссылка.Договор = ДоговорыКонтрагентов.Ссылка
		|ГДЕ
		|	ТЧ_ГрафикДвиженийПоДоговору.Ссылка = &Ссылка
		|	И ТЧ_ГрафикДвиженийПоДоговору.ДатаВозвратГарантийногоУдержания <> ДАТАВРЕМЯ(1, 1, 1)
		|	И ТЧ_ГрафикДвиженийПоДоговору.СуммаВозвратГарантийногоУдержания > 0";
		//|
		//|ОБЪЕДИНИТЬ ВСЕ
		//|
		//|ВЫБРАТЬ
		//|	ВложенныйЗапрос.ВидДвижения,
		//|	ВложенныйЗапрос.Период,
		//|	ВложенныйЗапрос.АналитикаУчетаПоПартнерам,
		//|	ВложенныйЗапрос.ЗаказПоставщику,
		//|	ВложенныйЗапрос.Валюта,
		//|	-ВложенныйЗапрос.КОплате,
		//|	-ВложенныйЗапрос.КОтгрузке,
		//|	ВложенныйЗапрос.ХозяйственнаяОперация,
		//|	ВложенныйЗапрос.ДатаРегистратора,
		//|	"""" КАК НомерРегистратора,
		//|	ВложенныйЗапрос.Валюта,
		//|	ВложенныйЗапрос.ДатаПлатежа
		//|ИЗ
		//|	(ВЫБРАТЬ
		//|		РасчетыСКлиентами.Период КАК Период,
		//|		РасчетыСКлиентами.ВидДвижения КАК ВидДвижения,
		//|		РасчетыСКлиентами.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
		//|		РасчетыСКлиентами.ЗаказПоставщику КАК ЗаказПоставщику,
		//|		РасчетыСКлиентами.Валюта КАК Валюта,
		//|		СУММА(РасчетыСКлиентами.Сумма) КАК Сумма,
		//|		СУММА(РасчетыСКлиентами.КОплате) КАК КОплате,
		//|		СУММА(РасчетыСКлиентами.Оплачивается) КАК Оплачивается,
		//|		СУММА(РасчетыСКлиентами.КПоступлению) КАК КОтгрузке,
		//|		РасчетыСКлиентами.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
		//|		РасчетыСКлиентами.ФормаОплаты КАК ФормаОплаты,
		//|		РасчетыСКлиентами.ЗакупкаПоЗаказу КАК ЗакупкаПоЗаказу,
		//|		РасчетыСКлиентами.ДатаРегистратора КАК ДатаРегистратора,
		//|		РасчетыСКлиентами.ДатаПлатежа КАК ДатаПлатежа,
		//|		РасчетыСКлиентами.СуммаРегл КАК СуммаРегл,
		//|		РасчетыСКлиентами.СуммаУпр КАК СуммаУпр,
		//|		РасчетыСКлиентами.ЗалогЗаТару КАК ЗалогЗаТару,
		//|		РасчетыСКлиентами.СтатьяДвиженияДенежныхСредств КАК СтатьяДвиженияДенежныхСредств,
		//|		РасчетыСКлиентами.РасчетныйДокумент КАК РасчетныйДокумент
		//|	ИЗ
		//|		РегистрНакопления.РасчетыСПоставщиками КАК РасчетыСКлиентами
		//|	ГДЕ
		//|		РасчетыСКлиентами.АналитикаУчетаПоПартнерам = &АналитикаУчетаПоПартнерам
		//|		И РасчетыСКлиентами.Регистратор.ОбъектСтроительства = &ОбъектСтроительства
		//|		И РасчетыСКлиентами.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		//|		И (РасчетыСКлиентами.Регистратор ССЫЛКА Документ.УСОERP_ДоговорССубподрядчиком
		//|				ИЛИ РасчетыСКлиентами.Регистратор ССЫЛКА Документ.УСОERP_ГрафикДвиженийПоДоговору)
		//|		И РасчетыСКлиентами.Регистратор <> &Ссылка
		//|		И РасчетыСКлиентами.ДатаРегистратора <= &Период
		//|	
		//|	СГРУППИРОВАТЬ ПО
		//|		РасчетыСКлиентами.Период,
		//|		РасчетыСКлиентами.ВидДвижения,
		//|		РасчетыСКлиентами.АналитикаУчетаПоПартнерам,
		//|		РасчетыСКлиентами.ЗаказПоставщику,
		//|		РасчетыСКлиентами.Валюта,
		//|		РасчетыСКлиентами.ХозяйственнаяОперация,
		//|		РасчетыСКлиентами.ФормаОплаты,
		//|		РасчетыСКлиентами.ЗакупкаПоЗаказу,
		//|		РасчетыСКлиентами.ДатаРегистратора,
		//|		РасчетыСКлиентами.ДатаПлатежа,
		//|		РасчетыСКлиентами.СуммаРегл,
		//|		РасчетыСКлиентами.СуммаУпр,
		//|		РасчетыСКлиентами.ЗалогЗаТару,
		//|		РасчетыСКлиентами.СтатьяДвиженияДенежныхСредств,
		//|		РасчетыСКлиентами.РасчетныйДокумент) КАК ВложенныйЗапрос
		//|ГДЕ
		//|	(-ВложенныйЗапрос.КОплате <> 0
		//|			ИЛИ -ВложенныйЗапрос.КОтгрузке <> 0)
		//|	И &ДелатьСторно = ИСТИНА ";
		
	Иначе
		
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
		|	ТЧ_ГрафикДвиженийПоДоговору.ДатаСобытия КАК Период,
		|	&АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
		|	ТЧ_ГрафикДвиженийПоДоговору.Ссылка.Договор КАК ЗаказПоставщику,
		|	ДоговорыКонтрагентов.Ссылка.ВалютаВзаиморасчетов КАК Валюта,
		//|	СУММА(ВЫБОР
		//|			КОГДА ТЧ_ГрафикДвиженийПоДоговору.ВидДвиженияДоходРасход = ЗНАЧЕНИЕ(Перечисление.УСОERP_ПорядокДоходовРасходов.ПустаяСсылка)
		//|				ТОГДА ТЧ_ГрафикДвиженийПоДоговору.ОбщаяСумма
		//|			ИНАЧЕ 0
		//|		КОНЕЦ) КАК КОплате,
		//|	СУММА(ВЫБОР
		//|			КОГДА ТЧ_ГрафикДвиженийПоДоговору.ВидДвиженияДоходРасход = ЗНАЧЕНИЕ(Перечисление.УСОERP_ПорядокДоходовРасходов.ПустаяСсылка)
		//|				ТОГДА ТЧ_ГрафикДвиженийПоДоговору.ОбщаяСумма
		//|			ИНАЧЕ 0
		|		СУММА(ТЧ_ГрафикДвиженийПоДоговору.ОбщаяСумма) КАК КОплате,
		|		СУММА(0) КАК КПоступлению,
		//|	СУММА(ВЫБОР
		//|			КОГДА ТЧ_ГрафикДвиженийПоДоговору.ВидДвиженияДоходРасход <> ЗНАЧЕНИЕ(Перечисление.УСОERP_ПорядокДоходовРасходов.ПустаяСсылка)
		//|				ТОГДА ТЧ_ГрафикДвиженийПоДоговору.ОбщаяСумма
		//|			ИНАЧЕ 0
		//|		КОНЕЦ) КАК КПоступлению,
		|	&Планирование_ЗаказПоставщику КАК ХозяйственнаяОперация,
		|	ТЧ_ГрафикДвиженийПоДоговору.Ссылка.Дата КАК ДатаРегистратора,
		|	&Номер КАК НомерРегистратора,
		|	ДоговорыКонтрагентов.Ссылка.ВалютаВзаиморасчетов КАК ВалютаДокумента,
		|	ТЧ_ГрафикДвиженийПоДоговору.ДатаСобытия КАК ДатаПлатежа
		|	,ТЧ_ГрафикДвиженийПоДоговору.ВидДвиженияДенежныхСредств КАК ВариантОплаты
		|	,МАКСИМУМ(ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Безналичная)) КАК ФормаОплаты
		
		|ИЗ
		|	Документ.УСОERP_ДоговорССубподрядчиком.ГрафикДвиженияПоДоговору КАК ТЧ_ГрафикДвиженийПоДоговору
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|		ПО ТЧ_ГрафикДвиженийПоДоговору.Ссылка.Договор = ДоговорыКонтрагентов.Ссылка
		|ГДЕ
		|	ТЧ_ГрафикДвиженийПоДоговору.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ТЧ_ГрафикДвиженийПоДоговору.Ссылка,
		|	ДоговорыКонтрагентов.Ссылка.ВалютаВзаиморасчетов,
		|	ТЧ_ГрафикДвиженийПоДоговору.ДатаСобытия,
		|	ТЧ_ГрафикДвиженийПоДоговору.Ссылка.Дата,
		|	ТЧ_ГрафикДвиженийПоДоговору.ДатаСобытия
		|	,ТЧ_ГрафикДвиженийПоДоговору.ВидДвиженияДенежныхСредств
		//Новый вариант
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
		|	ТЧ_ГрафикДвиженийПоДоговору.ДатаСобытия КАК Период,
		|	&АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
		|	ТЧ_ГрафикДвиженийПоДоговору.Ссылка.Договор КАК ЗаказПоставщику,
		|	ДоговорыКонтрагентов.Ссылка.ВалютаВзаиморасчетов КАК Валюта,
		//|	СУММА(ВЫБОР
		//|			КОГДА ТЧ_ГрафикДвиженийПоДоговору.ВидДвиженияДоходРасход = ЗНАЧЕНИЕ(Перечисление.УСОERP_ПорядокДоходовРасходов.ПустаяСсылка)
		//|				ТОГДА ТЧ_ГрафикДвиженийПоДоговору.ОбщаяСумма
		//|			ИНАЧЕ 0
		//|		КОНЕЦ) КАК КОплате,
		//|	СУММА(ВЫБОР
		//|			КОГДА ТЧ_ГрафикДвиженийПоДоговору.ВидДвиженияДоходРасход = ЗНАЧЕНИЕ(Перечисление.УСОERP_ПорядокДоходовРасходов.ПустаяСсылка)
		//|				ТОГДА ТЧ_ГрафикДвиженийПоДоговору.ОбщаяСумма
		//|			ИНАЧЕ 0
		|		СУММА(0) КАК КОплате,
		//|	СУММА(ВЫБОР
		//|			КОГДА ТЧ_ГрафикДвиженийПоДоговору.ВидДвиженияДоходРасход <> ЗНАЧЕНИЕ(Перечисление.УСОERP_ПорядокДоходовРасходов.ПустаяСсылка)
		//|				ТОГДА ТЧ_ГрафикДвиженийПоДоговору.ОбщаяСумма
		//|			ИНАЧЕ 0
		|		СУММА(ТЧ_ГрафикДвиженийПоДоговору.ОбщаяСумма) КАК КПоступлению,
		|	&Планирование_ЗаказПоставщику КАК ХозяйственнаяОперация,
		|	ТЧ_ГрафикДвиженийПоДоговору.Ссылка.Дата КАК ДатаРегистратора,
		|	&Номер КАК НомерРегистратора,
		|	ДоговорыКонтрагентов.Ссылка.ВалютаВзаиморасчетов КАК ВалютаДокумента,
		|	ТЧ_ГрафикДвиженийПоДоговору.ДатаСобытия КАК ДатаПлатежа
		|	,ТЧ_ГрафикДвиженийПоДоговору.ВидДвиженияДенежныхСредств КАК ВариантОплаты
		|	,МАКСИМУМ(ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Безналичная)) КАК ФормаОплаты
		
		|ИЗ
		|	Документ.УСОERP_ДоговорССубподрядчиком.ГрафикДвиженияПоДоговору КАК ТЧ_ГрафикДвиженийПоДоговору
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|		ПО ТЧ_ГрафикДвиженийПоДоговору.Ссылка.Договор = ДоговорыКонтрагентов.Ссылка
		|ГДЕ
		|	ТЧ_ГрафикДвиженийПоДоговору.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ТЧ_ГрафикДвиженийПоДоговору.Ссылка,
		|	ДоговорыКонтрагентов.Ссылка.ВалютаВзаиморасчетов,
		|	ТЧ_ГрафикДвиженийПоДоговору.ДатаСобытия,
		|	ТЧ_ГрафикДвиженийПоДоговору.Ссылка.Дата,
		|	ТЧ_ГрафикДвиженийПоДоговору.ДатаСобытия
		|	,ТЧ_ГрафикДвиженийПоДоговору.ВидДвиженияДенежныхСредств ";
		
		//
		
		
		//|
		//|ОБЪЕДИНИТЬ ВСЕ
		//|
		//|ВЫБРАТЬ
		//|	ВложенныйЗапрос.ВидДвижения,
		//|	ВложенныйЗапрос.Период,
		//|	ВложенныйЗапрос.АналитикаУчетаПоПартнерам,
		//|	ВложенныйЗапрос.ЗаказПоставщику,
		//|	ВложенныйЗапрос.Валюта,
		//|	-ВложенныйЗапрос.КОплате,
		//|	-ВложенныйЗапрос.КОтгрузке,
		//|	ВложенныйЗапрос.ХозяйственнаяОперация,
		//|	ВложенныйЗапрос.ДатаРегистратора,
		//|	"""" КАК НомерРегистратора,
		//|	ВложенныйЗапрос.Валюта,
		//|	ВложенныйЗапрос.ДатаПлатежа
		////|	,ВложенныйЗапрос.ВариантОплаты
		//   			|ИЗ
		//|	(ВЫБРАТЬ
		//|		РасчетыСКлиентами.Период КАК Период,
		//|		РасчетыСКлиентами.ВидДвижения КАК ВидДвижения,
		//|		РасчетыСКлиентами.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
		//|		РасчетыСКлиентами.ЗаказПоставщику КАК ЗаказПоставщику,
		//|		РасчетыСКлиентами.Валюта КАК Валюта,
		//|		СУММА(РасчетыСКлиентами.Сумма) КАК Сумма,
		//|		СУММА(РасчетыСКлиентами.КОплате) КАК КОплате,
		//|		СУММА(РасчетыСКлиентами.Оплачивается) КАК Оплачивается,
		//|		СУММА(РасчетыСКлиентами.КПоступлению) КАК КОтгрузке,
		//|		РасчетыСКлиентами.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
		//|		РасчетыСКлиентами.ФормаОплаты КАК ФормаОплаты,
		//|		РасчетыСКлиентами.ЗакупкаПоЗаказу КАК ЗакупкаПоЗаказу,
		//|		РасчетыСКлиентами.ДатаРегистратора КАК ДатаРегистратора,
		//|		РасчетыСКлиентами.ДатаПлатежа КАК ДатаПлатежа,
		//|		РасчетыСКлиентами.СуммаРегл КАК СуммаРегл,
		//|		РасчетыСКлиентами.СуммаУпр КАК СуммаУпр,
		//|		РасчетыСКлиентами.ЗалогЗаТару КАК ЗалогЗаТару,
		//|		РасчетыСКлиентами.СтатьяДвиженияДенежныхСредств КАК СтатьяДвиженияДенежныхСредств,
		//|		РасчетыСКлиентами.РасчетныйДокумент КАК РасчетныйДокумент,
		//|   МАКСИМУМ(ЗНАЧЕНИЕ(Перечисление.ВариантыОплатыКлиентом.ПустаяСсылка)) КАК ВариантОплаты
		
		//|	ИЗ
		//|		РегистрНакопления.РасчетыСПоставщиками КАК РасчетыСКлиентами
		//|	ГДЕ
		//|		РасчетыСКлиентами.АналитикаУчетаПоПартнерам = &АналитикаУчетаПоПартнерам
		//|		И РасчетыСКлиентами.Регистратор.ОбъектСтроительства = &ОбъектСтроительства
		//|		И РасчетыСКлиентами.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		//|		И (РасчетыСКлиентами.Регистратор ССЫЛКА Документ.УСОERP_ДоговорССубподрядчиком
		//|				ИЛИ РасчетыСКлиентами.Регистратор ССЫЛКА Документ.УСОERP_ГрафикДвиженийПоДоговору)
		//|		И РасчетыСКлиентами.Регистратор <> &Ссылка
		//|		И РасчетыСКлиентами.ДатаРегистратора <= &Период
		//|	
		//|	СГРУППИРОВАТЬ ПО
		//|		РасчетыСКлиентами.Период,
		//|		РасчетыСКлиентами.ВидДвижения,
		//|		РасчетыСКлиентами.АналитикаУчетаПоПартнерам,
		//|		РасчетыСКлиентами.ЗаказПоставщику,
		//|		РасчетыСКлиентами.Валюта,
		//|		РасчетыСКлиентами.ХозяйственнаяОперация,
		//|		РасчетыСКлиентами.ФормаОплаты,
		//|		РасчетыСКлиентами.ЗакупкаПоЗаказу,
		//|		РасчетыСКлиентами.ДатаРегистратора,
		//|		РасчетыСКлиентами.ДатаПлатежа,
		//|		РасчетыСКлиентами.СуммаРегл,
		//|		РасчетыСКлиентами.СуммаУпр,
		//|		РасчетыСКлиентами.ЗалогЗаТару,
		//|		РасчетыСКлиентами.СтатьяДвиженияДенежныхСредств,
		//|		РасчетыСКлиентами.РасчетныйДокумент) КАК ВложенныйЗапрос
		//|ГДЕ
		//|	(-ВложенныйЗапрос.КОплате <> 0
		//|			ИЛИ -ВложенныйЗапрос.КОтгрузке <> 0)
		//|	И &ДелатьСторно = ИСТИНА";
		
	КонецЕсли;
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	
	Возврат ТекстЗапроса;
	
КонецФункции

#КонецОбласти

#Область Отчеты
// Определяет список команд отчетов.
//
// Параметры:
//   КомандыОтчетов - ТаблицаЗначений - Таблица с командами отчетов. Для изменения.
//       См. описание 1 параметра процедуры ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов().
//   Параметры - Структура - Вспомогательные параметры. Для чтения.
//       См. описание 2 параметра процедуры ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов().
//
Процедура ДобавитьКомандыОтчетов(КомандыОтчетов, Параметры) Экспорт
	
	ВариантыОтчетовУТПереопределяемый.ДобавитьКомандуСтруктураПодчиненности(КомандыОтчетов);
	
КонецПроцедуры

#КонецОбласти 


#Область Печать

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт

КонецПроцедуры

// Сформировать печатные формы объектов
//
// ВХОДЯЩИЕ:
//   ИменаМакетов    - Строка    - Имена макетов, перечисленные через запятую
//   МассивОбъектов  - Массив    - Массив ссылок на объекты которые нужно распечатать
//   ПараметрыПечати - Структура - Структура дополнительных параметров печати
//
// ИСХОДЯЩИЕ:
//   КоллекцияПечатныхФорм - Таблица значений - Сформированные табличные документы
//   ПараметрыВывода       - Структура        - Параметры сформированных табличных документов
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	ПараметрыВывода.ДоступнаПечатьПоКомплектно = Истина;
		
	ФормированиеПечатныхФорм.ЗаполнитьПараметрыОтправки(ПараметрыВывода.ПараметрыОтправки, МассивОбъектов, КоллекцияПечатныхФорм);
	
КонецПроцедуры

Процедура ЗаполнитьСтруктуруПолучателейПечатныхФорм(СтруктураДанныхОбъектаПечати) Экспорт
		
КонецПроцедуры

Функция ДоступныеДляШаблоновПечатныеФормы() Экспорт

	МассивДоступныхПечатныхФорм = Новый Массив;
		
	Возврат МассивДоступныхПечатныхФорм

КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли
